# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [15]:
import sqlite3
import pandas as pd

In [24]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()
def run_sql(sql):
    df = pd.DataFrame(cur.execute(sql).fetchall())
    df.columns = [i[0] for i in cur.description]
    return df

In [25]:
# run_sql('''SELECT * FROM employees''')

## Display the names of all the employees in Boston.

In [26]:
run_sql('''SELECT * FROM employees WHERE officeCode = '2';''')

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep

## Do any offices have no employees?

In [33]:
# run_sql('''SELECT * FROM employees
#                     JOIN offices
#                     USING (officeCode)
#                     GROUP BY officeCode
#                     ORDER BY officeCode''')

## Write 3 Questions of your own and answer them

In [34]:
# Answers will vary

In [35]:
# Your code here

In [36]:
# Your code here

In [37]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [51]:
run_sql('''SELECT e.firstName as Emp_Fname, e.lastName as Emp_Lname, 
                    c.customerName, c.customerNumber,
                    o.orderNumber, d.productCode
                    FROM employees e
                      JOIN customers c
                      ON e.employeeNumber = c.salesRepEmployeeNumber
                      JOIN orders o
                      ON c.customerNumber = o.customerNumber
                      JOIN orderdetails d
                      ON o.orderNumber = d.orderNumber
                      JOIN products p
                      ON 
                      GROUP BY e.employeeNumber''')

,Emp_Fname,Emp_Lname,customerName,customerNumber,orderNumber,productCode
0,Leslie,Jennings,Signal Collectibles Ltd.,487,10219,S32_2509
1,Leslie,Thompson,West Coast Collectables Co.,475,10215,S24_4258
2,Julie,Firrelli,Diecast Collectables,495,10243,S24_1937
3,Steve,Patterson,FunGiftIdeas.com,462,10388,S700_2834
4,Foon Yue,Tseng,Microscale Inc.,456,10319,S50_4713
5,George,Vanauf,Motor Mint Distributors Inc.,486,10331,S50_4713
6,Loui,Bondur,Auto Canal+ Petit,406,10402,S24_2000
7,Gerard,Hernandez,Auto Associ√©s & Cie.,256,10304,S700_2824
8,Pamela,Castillo,Frau da Collezione,473,10218,S18_3232
9,Larry,Bott,"Double Decker Gift Stores, Ltd",489,10213,S24_2887
10,Barry,Jones,Scandinavian Gift Ideas,448,10389,S24_2000
11,Andy,Fixter,"Australian Collectables, Ltd",471,10415,S72_1253
12,Peter,Marsh,Kelly's Gift Shop,496,10399,S32_1374
13,Mami,Nishi,"Tokyo Collectables, Ltd",398,10408,S24_3969
14,Martin,Gerard,"Iberia Gift Imports, Corp.",484,10303,S24_3969

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!